import 'dart:async';
import 'dart:math';

import 'models/models.dart';
import 'restaurants_repository.dart';

class FakeRestaurantsRepository implements RestaurantsRepository {
  final _listeners = <MultiStreamController<List<Restaurant>>>[];

  final List<Restaurant> _restaurants = [];

  final rand = Random();

  @override
  Stream<Restaurant> restaurant(String id) async* {
    if (_restaurants.where((restaurant) => restaurant.id == id).isEmpty) {
      await create(Restaurant(
        id: id,
        displayName: _randName,
        address: Address(
          name: _randAddress,
          latitude: 31.2431906939,
          longitude: 34.7931751606,
        ),
        phoneNumber: '+97212345${1000 + rand.nextInt(8999)}',
        about:
            'בין 40₪-60₪.‏🔹המחיר לפי ק״ג. לא חייב לקנות ק״ג🔹‎מוזמנים למסעדת פאטיו בכל יום בין השעות 10:00-14:00. ובכל יום שישי למכירת האוכל שלנו בנקודות המכירה: ‏🔸קניון ‏דרך ‏הים, ‏עתלית.‏🔸מסעדת ‏פאטיו ‏(אתגר ‏5, ‏טירת ‏כרמל)08:00-14:00 לפרטים/הזמנות/סגירת תאריך לקייטרינג/משלוחים‏📞 ‎‏',
        photoURL:
            'https://firebasestorage.googleapis.com/v0/b/cookpoint-e16ce.appspot.com/o/logo.png?alt=media&token=7566ed32-d1d1-47ec-ae2c-3d805f38f935',
      ));
    }

    yield* stream().map((restaurants) {
      return restaurants.where((restaurants) => restaurants.id == id).first;
    });
  }

  @override
  Future<void> create(Restaurant restaurant) async {
    _restaurants.add(restaurant);
    emit();
  }

  @override
  Future<void> update(Restaurant restaurant) async {
    _restaurants.removeWhere((_restaurant) => _restaurant.id == restaurant.id);
    return create(restaurant);
  }

  Stream<List<Restaurant>> stream() {
    return Stream.multi((controller) {
      _listeners.add(controller);

      controller.onCancel = () {
        _listeners.remove(controller);
      };

      emit();
    });
  }

  void emit() {
    for (var listener in _listeners) listener.add(_restaurants);
  }

  static const _fNames = [
    'דוד',
    'אריאל',
    'לביא',
    'נועם',
    'יוסף',
    'אורי',
    'איתן',
    'משה',
    'רפאל',
    'ארי',
    'יהודה',
    'איתי',
    'דניאל',
    'אברהם',
    'ישראל',
    'יהונתן',
    'שמואל',
    'אליה',
    'אהרון',
    'יצחק',
    'מיכאל',
    'עומר',
    'יעקב',
    'יונתן',
    'חיים',
    'איתמר',
    'שמעון',
    'שלמה',
    'יאיר',
    'עידו',
    'ינאי',
    'אדם',
    'אלון',
    'בניה',
    'אימרי',
    'הראל',
    'ניתאי',
    'מאיר',
    'ישי',
    'תמר',
    'מאיה',
    'נועה',
    'אביגיל',
    'איילה',
    'יעל',
    'שרה',
    'אדל',
    'שירה',
    'אסתר',
    'חנה',
    'רבקה',
    'ליה',
    'רחל',
    'רוני',
    'רומי',
    'אלה',
    'חיה',
    'מיכל',
    'טליה',
    'נויה',
    'מרים',
    'אמה',
    'עלמה',
    'רות',
    'הלל',
    'ליבי',
    'יובל',
    'הודיה',
    'אריאל',
    'נעמי',
    'אגם',
    'טוהר',
    'עומר',
    'גאיה',
    'גפן',
    'אורי',
    'לי-שי',
    'נגה',
  ];

  static const _lNames = [
    'כהן',
    'לוי',
    'מזרחי',
    'פרץ',
    'ביטון',
    'דהן',
    'אברהם',
    'אגבאריה',
    'פרידמן',
  ];

  static const _addresses = <String>[
    'אבו גוש',
    'אבטין',
    'אביאל',
    'אביבים',
    'אביגדור',
    'אביחיל',
    'אביטל',
    'אביעזר',
    'אבירים',
    'אבן יהודה',
    'אבן מנחם',
    'אבן ספיר',
    'אבני איתן',
    'אבני חפץ',
    'אבנת',
    'אבשלום',
    'אדורה',
    'אדירים',
    'אדמית',
    'אדרת',
    'אוגדה',
    'אודים',
    'אודם',
    'אוהד',
    'אום בטין',
    'אופקים',
    'אור הגנוז',
    'אור הנר',
    'אור יהודה',
    'אור עקיבא',
    'אורה',
    'איילת השחר',
    'אילון',
    'אילות',
    'אילניה',
    'אילת',
    'אירוס',
    'איתמר',
    'איתן',
    'אכסאל',
    'אל עזי',
    'אל-עריאן',
    'אל-רום',
    'אלומה',
    'אלומות',
    'אלון הגליל',
    'אלונים',
    'אלמגור',
    'אלמוג',
    'אלעד',
    'אלעזר',
    'אפיניש',
    'אפיק',
    'אפיקים',
    'אפק',
    'אפרת',
    'ארבל',
    'ארגמן',
    'ארז',
    'אריאל',
    'ארסוף',
    'אשבול',
    'אשבל',
    'אשדוד',
    'אשדות יעקב איחוד',
    'אשדות יעקב מאוחד',
    'אשחר',
    'אשכולות',
    'אשל הנשיא',
    'אשלים',
    'אשקלון',
    'ביריה',
    'בית אורן',
    'בית אל',
    'בית אלעזרי',
    'בית אלפא',
    'בית אריה-עופרים',
    'בית ברל',
    'בית גוברין',
    'בית גמליאל',
    'בית דגן',
    'בית הגדי',
    'בית הלוי',
    'בית הלל',
    'בית הערבה',
    'בית השיטה',
    'בית זייד',
    'בית זית',
    'בית זרע',
    'בית חגי',
    'בית חלקיה',
    'בית חנניה',
    'בית חרות',
    'בית חשמונאי',
    'בית יהושע',
    'בית יוסף',
    'בני ציון',
    'בני ראם',
    'בניה',
    'בצת',
    'בקוע',
    'בקעות',
    'בר גיורא',
    'בר יוחאי',
    'ברוכין',
    'ברור חיל',
    'ברוש',
    'ברכיה',
    'ברעם',
    'ברק',
    'ברקאי',
    'ברקן',
    'ברקת',
    'בת הדר',
    'בת חן',
    'גבע בנימין',
    'גבע כרמל',
    'גבעת זאב',
    'גבעת ח"ן',
    'גבעת חביבה',
    'גבעת חיים איחוד',
    'גזית',
    'גזר',
    'גיאה',
    'גיזו',
    'גילון',
    'גילת',
    'גינוסר',
    'גן שמואל',
    'גנות',
    'גני הדר',
    'גני טל',
    'גני יוחנן',
    'גני מודיעין',
    'גני עם',
    'גני תקווה',
    'גניגר',
    'גנתון',
    'זמר',
    'זמרת',
    'זנוח',
    'חגור',
    'חגלה',
    'חד נס',
    'חדיד',
    'חדרה',
    'חוות יאיר',
    'חולדה',
    'חולון',
    'חולית',
    'חולתה',
    'חוסן',
    'חוסנייה',
    'חופית',
    'חוקוק',
    'חורה',
    'חורפיש',
    'חורשים',
    'חזון',
    'חיבת ציון',
    'חיננית',
    'חיספין',
    'חיפה',
    'חצור הגלילית',
    'חצרים',
    'חרב לאת',
    'חרוצים',
    'חרות',
    'חריש',
    'חרמש',
    'טירת צבי',
    'טל שחר',
    'טל-אל',
    'טללים',
    'יבול',
    'יבנאל',
    'יבנה',
    'יגור',
    'יגל',
    'יד בנימין',
    'יד השמונה',
  ];

  String get _randName => '${_fNames[rand.nextInt(_fNames.length)]} '
      '${_lNames[rand.nextInt(_lNames.length)]}';

  String get _randAddress => _addresses[rand.nextInt(_addresses.length)];
}
