import 'dart:async';

import 'package:cookpoint/splash/splash.dart';
import 'package:flutter/material.dart';
import 'package:shared_preferences/shared_preferences.dart';

class TermsOfService extends StatelessWidget {
  const TermsOfService({
    Key key,
    this.title,
    this.body,
    this.onPressed,
  }) : super(key: key);

  static Route route() {
    return MaterialPageRoute<void>(
      settings: const RouteSettings(name: '/legal/terms-of-service'),
      builder: (_) => const TermsOfService(),
    );
  }

  /// @nullable
  final Widget title;

  /// @nullable
  final String body;

  /// @nullable
  final VoidCallback onPressed;

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: title ?? const Text('תנאים ומדיניות פרטיות'),
      ),
      body: SafeArea(
        child: ListView(
          children: [
            Text(body ?? _getDefaultBody()),
            Padding(
              padding: const EdgeInsets.all(8.0),
              child: ElevatedButton(
                onPressed: onPressed ?? () => Navigator.of(context).pop(true),
                child: const Text('אני מקבל/ת את תנאי השירות'),
              ),
            ),
          ],
        ),
      ),
    );
  }

  String _getDefaultBody() {
    return '''CookPoint מברכת את בחירתכם להשתמש באפליקציה בהתאם להוראות השימוש המפורטות בתקנון זה. 
CookPoint היא אפליקציה המשמשת כפלטפורמה נוחה לבשלנים לפרסום מזון ביתי ודברי מאכל ("המוצרים") למשתמשי האפליקציה. משתמשי האפליקציה יכולים לערוך חיפוש של בשלנים ומוצרי מזון באפליקציה, ולרכוש מהבשלנים את מוצריהם באמצעות פרטי ההתקשרות המוצגים בפרופיל הבשלן.  
תקנון ותנאי שימוש אלה מהווים הסכם מחייב בינך (״אתה״) לבין האפליקציה בנוגע לשימוש באפליקציה בכל טלפון סלולרי, טאבלט או מכשיר תקשורת אחר כדוגמת מחשב. כמו כן הם חלים על השימוש באפליקציה, בין באמצעות רשת האינטרנט ובין באמצעות כל רשת או אמצעי תקשורת אחר (״האפליקציה״). קרא את תנאי השימוש בקפידה, שכן השימוש באפליקציה וביצוע פעולות בה מעידים על הסכמתך לתנאים הכלולים בתקנון ותנאי שימוש אלו (״התקנון״). 
1. כללי:
   1. האמור בתקנון זה מתייחס באופן שווה לבני שני המינים והשימוש בלשון זכר או נקבה הוא מטעמי נוחות בלבד. 
   2. השימוש באפליקציה מותר בכל גיל. 
   3. תנאי תקנון זה מהווים את כל ההסכמות וההבנות בנוגע לשימוש באפליקציה. אי מימוש או אכיפה של זכות או הוראה בתקנון זה, לא תחשב כוויתור מצד האפליקציה על מימוש הזכות או אכיפת ההוראה. האפליקציה תהיה רשאי להמחות לאחרים את כל או חלק מזכויותיה ו/או חובותיה בתקנון זה.
   4. במקרה שייקבע כי הוראה בתקנון זה אינה ניתנת לאכיפה או שהינה חסרת תוקף מטעם כלשהו, לא יהא בכך כדי להשפיע או לפגוע בחוקיותן, תקפותן ואכיפתן של שאר הוראות התקנון. 
2. השימוש באפליקציה:
   1. שמות הבשלנים המציעים מוצרים לרכישה יוצגו באפליקציה.
   2. האפליקציה אינה מחויבת, בכל דרך שהיא, לקיים מגוון כלשהו של מוצרים ו/או בשלנים.
   3. האפליקציה רשאית בכל עת לשנות את מגוון הבשלנים ו/או המוצרים המוצגים באפליקציה, להחליפם להמעיט מהם, להוסיף עליהם, ללא כל הודעה או התראה מוקדמת.
   4. אופן הצגת המוצרים והבשלנים באפליקציה הינו על-פי שיקול דעתה הבלעדי של האפליקציה.
   5. על מנת לרכוש מבשלן המפורסם באפליקציה, יש ליצור קשר באופן ישיר עם הבשלן באמצעות פרטי ההתקשרות המוצגים בפרופיל הבשלן. ההזמנה והרכישה תתבצע ישירות אל מול הבשלן.
   6. האפליקציה ניתנת להורדה ללא עלות בחנויות האפליקציות Apple Store (אפל סטור), Google Play (גוגל פליי) (״חנויות האפליקציות״).
   7. בנוסף להוראות תקנון זה יחולו הוראות תקנוני חנויות האפליקציות. 
3. חנויות האפליקציות:
   1. התנאים הבאים נוגעים לשימוש באפליקציה שהורדה דרך חנויות האפליקציות: 
      1. רישיון השימוש באפליקציה מוגבל ובלתי ניתן להעברה במכשיר בו הנך משתמש וכפוף לתנאי השימוש של חנויות האפליקציות.
      2. אחריות האפליקציה לתחזוקה ותמיכה באפליקציה תהיה כאמור בתקנון זה.
      3. הנך מצהיר ומסכים כי: (1) אינך עושה שימוש באפליקציה במדינה הכפופה לאמברגו של ממשלת ארה״ב או מדינה המוגדרת על ידי ממשלת ארה״ב כמדינת ״תומכת טרור״; (2) אינך נמצא ברשימה אסורה או מוגבלת של ממשלת ארה״ב.
      4. בעת שימוש באפליקציה, הנך מתחייב לעמוד בהוראות חנויות האפליקציות וצד שלישי.
      5. הנך מסכים ומאשר כי חנויות האפליקציות מוטבות כצד שלישי לתנאי תקנון זה ורישיון השימוש באפליקציה וכי לכל חנות אפליקציות תהיה הזכות לאכוף את תנאי תקנון זה.  
4. הרשמה לבשלנים לפרסום באפליקציה:
   1. בשלן המעוניין לפרסם את מוצריו באפליקציה יכול להירשם למנוי לפרסום באפליקציה ולהקים פרופיל בשלן. 
   2. הרשמה למנוי לפרסום תיעשה באמצעות הרשמה ורכישה באפליקציה. 
   3. הרשמה ורכישה כפופה לתקנון ותנאי השימוש אשר יוצגו במעמד הרכישה, ומהווים חלק בלתי נפרד מתקנון זה.
5. פעילות אסורה באפליקציה:
   1. אינך רשאי להשתמש באפליקציה אלא למטרות שלשמן היא נועדה. השימוש באפליקציה מותר למטרות פרטיות ואישיות בלבד ואין לעשות בה שימוש למטרות מסחריות למעט כאלו שאושרו בתקנון זה ו/או שאושרו על ידי האפליקציה באופן ספציפי.
   2. כמשתמש האפליקציה אתה מסכים שלא:
      1. לאחזר נתונים או תוכן אחר מהאפליקציה כדי ליצור או להרכיב אוסף, מסד נתונים או מדריך ללא אישור מראש ובכתב מהאפליקציה;
      2. לעשות שימוש לא מורשה באפליקציה, לרבות איסוף שמות משתמשים, כתובות דוא"ל וכיו״ב באמצעים אלקטרוניים או אחרים לצורך שליחת דוא"ל, או יצירת חשבונות משתמשים באמצעים אוטומטיים;
      3. לעקוף, להשבית או להפריע בדרך אחרת לאבטחת האפליקציה, לרבות שימוש ביישומים המונעים או מגבילים את השימוש או ההעתקה של תוכן כלשהו;
      4. להונות או להטעות את האפליקציה ו/או את משתמשיה, בייחוד בניסיון להעתיק מידע רגיש כמו סיסמאות ו/או קודים של משתמשים;
      5. לעשות שימוש לא נכון בשירותי התמיכה של האפליקציה;
      6. לעשות שימוש אוטומטי במערכת, כגון שימוש בסקריפטים לשליחת הערות או הודעות, או שימוש בכריית נתונים, רובוטים או כלי איסוף וחילוץ נתונים דומים;
      7. לנסות להתחזות למשתמש או לאדם אחר או להשתמש בשם המשתמש ו/או הקוד ו/או הסיסמה של משתמש אחר;
      8. למכור או להעביר את החשבון האישי שלך ו/או את הסיסמה שקבלת;
      9. להשתמש במידע שהתקבל באפליקציה על מנת להטריד, להתעלל או לפגוע באדם אחר;
      10. להשתמש באפליקציה כחלק מכל מאמץ להתחרות באפליקציה;
      11. לאחזר, לפענח או להנדס לאחור חלק מהאפליקציה, אפשרות בה או יישום בה;
      12. למחוק את זכויות היוצרים או את הודעת הזכויות הקנייניות מכל תוכן או סימן;
      13. להעתיק או להתאים את  קוד האפליקציה או חלק ממנו, כולל אך לא רק Dart, PHP, HTML, JavaScript, שפות native או קוד אחר;
      14. להעלות או להעביר (או לנסות להעלות או להעביר) וירוסים, סוסים טרויאניים, או חומר אחר, כולל שימוש בדואר זבל, אשר יפריע לשימוש באפליקציה;
      15.  לבצע פעולה שתפגע או תזיק לאפליקציה, בהתאם לשיקול דעתה של האפליקציה;
      16. להשתמש באפליקציה באופן שאינו עולה בקנה אחד החוק, התקנות והפסיקה.
   3. כל שימוש באפליקציה תוך הפרה של האמור לעיל עלול לגרום, בין היתר, לסיום או השעיית זכויותיך לשימוש באפליקציה.
6. שיפוי:
   1. על המשתמש לשפות את האפליקציה, עובדיה, מנהליה, שותפיה העסקיים או מי מטעמם בגין כל נזק, הפסד, אבדן רווח, תשלום או הוצאה שייגרמו להם - ובכלל זה שכ"ט עו"ד והוצאות משפט עקב הפרת התקנון. 
   2. בנוסף, ישפה המשתמש את האפליקציה, עובדיה, מנהליה  או מי מטעמם בגין כל טענה, תביעה ו/או דרישה שתועלה נגדם על ידי צד שלישי כלשהו כתוצאה מתכנים שנמסרו על ידו לפרסום באפליקציה וכתוצאה מקישורים שביצע לאפליקציה או בגין: (1) השימוש באפליקציה; (2) הפרת זכויותיו של צד שלישי, לרבות זכויות בקניין רוחני. 
7. אחריות האפליקציה:
   1. אין לראות במידע המופיע באפליקציה משום הבטחה לתוצאה כלשהי ו/או אחריות לאופן מתן השירות. האפליקציה לא תהיה אחראית לשום נזק, ישיר או עקיף, אשר ייגרם למשתמש כתוצאה מהסתמכות על מידע המופיע באפליקציה ו/או בקישורים אחרים ו/או כל מקור מידע פנימי ו/או חיצוני אחר ו/או שימוש בשירותים אשר מוצגים על ידה.
   2. התכנים באפליקציה ניתנים לשימוש כמות שהם (AS-IS). לא ניתן להתאימם לצרכיו של כל אדם ואדם. לא תהיה למשתמש כל טענה, תביעה או דרישה כלפי האפליקציה בגין תכונות של התכנים, יכולותיהם, מגבלותיהם ו/או התאמתם לצרכיו והשימוש באפליקציה יהיה על אחריותו הבלעדית של המשתמש באפליקציה.
   3. האפליקציה אינה צד להתקשרות בין הלקוח לבשלן והוא פועל אך ורק בכדי לקשר בין המשתמשים לבשלנים. רכישה מהבשלנים באפליקציה תתבצע באופן ישיר מול הבשלן באמצעות פרטי ההתקשרות המופיעים בפרופיל הבשלן. יובהר כי האפליקציה אינה מספקת את המוצרים המוצעים לרכישה על ידי הבשלנים אלא משמש כפלטפורמה מקוונת בלבד, המתווכת בין המשתמשים לבשלנים. כל פנייה שיש ללקוח בקשר למוצרים ואספקתם תיעשה ישירות לבשלן ממנו נרכשו המוצרים.
   4. המוצרים המופיעים באפליקציה מסופקים על ידי הבשלנים, צדדים שלישיים, שההתקשרות עמם נעשית על אחריותו הבלעדית של המשתמש ולא תהיה למשתמש כל טענה כלפי האפליקציה, מנהליה, עובדיה או מי מטעמה והם לא יהיו אחראים, באופן ישיר או עקיף, לכל נזק לרבות, לגוף, לרכוש או לכל נזק אחר או לכל הפסד אחר, אשר יגרם כתוצאה מרכישת מוצרים מהבשלנים המפורסמים באפליקציה, אפילו אם האפליקציה הזהירה, המליצה או ייעצה לעניין מסוים או על שירות ו/או מוצר ו/או בשלן מסוים ובשום מקרה האפליקציה לא תהווה תחליף או תישא באחריות של הבשלנים על אופן אספקת המוצרים, מועד האספקה, טיב המוצרים, תשלום וכיו״ב. משתמשי האפליקציה יישאו באחריות לפנות ולדרוש מהבשלן כל פיצוי בגין כל נזק, ישיר או עקיף, אשר ייגרם לו. 
   5. מידע ומצגים המוצגים באפליקציה, שמקורם בבשלנים שמוצריהם מופיעים באפליקציה וכל תוכן ביחס למוצרים נמצאים באחריותם הבלעדית של הבשלנים כאמור, ועל כן מובן שלאפליקציה אין כל אחריות בגין מידע מעין זה, ואין האפליקציה ערבה למידת הדיוק של מידע זה.
   6. האפליקציה לא תהיה אחראית לכל נזק (ישיר או עקיף), הפסד, עגמת נפש והוצאות שייגרמו למשתמשים ו/או לצדדים שלישיים כלשהם בעקבות שימוש או הסתמכות על כל תוכן, מידע, נתון, מצג, תמונה, וידאו, אודיו, פרסומת, מוצר, שירות וכו' המופעים באפליקציה. כל הסתמכות כאמור נעשית על-פי שיקול דעתו ואחריותו הבלעדית של המשתמש באפליקציה.
   7. האפליקציה ממליצה למשתמשים לנהוג בתבונה ובזהירות, ולקרוא בעיון את המידע המוצג באפליקציה ובכלל זה את המידע ביחס לשירות עצמו, תיאורו והתאמתו, כמתואר להלן.
   8. האפליקציה בשום מקרה לא תהיה אחראית לנזק שנגרם למשתמש באפליקציה באמצעות יצירת קשר עם שותפיה העסקיים של האפליקציה. 
   9. השימוש באפליקציה ייעשה על אחריותו הבלעדית והמלאה של כל משתמש. כל החלטה שתתקבל ביחס לתכנים שיתפרסמו באפליקציה הינה באחריותו המלאה. 
8. שינויים באפליקציה, תקלות והפסקות שירות:
   1. האפליקציה שומרת את הזכות לשנות מעת לעת או להסיר את תוכן באפליקציה מכל סיבה שהיא לפי שיקול דעתה הבלעדי וללא הודעה מוקדמת. האפליקציה אינה מחויבת לעדכן מידע או תוכן כלשהו באפליקציה.
   2. האפליקציה לא תהיה אחראית כלפיך או כלפי צד שלישי כלשהו עבור שינוי, השעיה או הפסקת שירותיה.
   3. האפליקציה אינה מתחייבת ששירותיה לא יופרעו, יינתנו כסדרם או בלא הפסקות, יתקיימו בבטחה וללא טעויות ויהיו חסינים מפני גישה בלתי מורשית למחשבי האפליקציה או מפני נזקים, קלקולים, תקלות או כשלים -  והכל, בחומרה, בתוכנה, בקווי ובמערכות תקשורת אצל האפליקציה או אצל מי מספקיה.
9. סיום:
   1. תנאי תקנון זה יישארו בתוקפם בעת השימוש באפליקציה. מבלי לגרוע מכל הוראה אחרת בתקנון זה, האפליקציה שומרת על זכותה למנוע מכל משתמש את השימוש באפליקציה (לרבות חסימת כתובות IP מסוימות), מכל סיבה או נימוק שהוא (מבלי שתצטרך לספק סיבה או נימוק), לשיקול דעתה הבלעדי, ללא צורך בהודעה מוקדמת או התראה ומבלי שתהיה אחראית לנזק כלשהו עקב החלטתה. כמו כן, האפליקציה רשאית להפסיק את השימוש שלך בה ו/או למחוק את חשבונך וכל תוכן או מידע שפרסמת בכל עת, ללא אזהרה מראש.
   2. מבלי לגרוע מהאמור לעיל, האפליקציה רשאית למנוע שימוש ממשתמש, או לחסום גישתם אליה בכל אחד מהמקרים הבאים:
      1. אם בעת הכניסה לאפליקציה נמסרו במתכוון פרטים שגויים;
      2. במקרה שנעשה שימוש באפליקציה לביצוע או כדי לנסות לבצע מעשה בלתי חוקי על-פי דיני מדינת ישראל, או מעשה הנחזה על פניו כבלתי חוקי כאמור, או כדי לאפשר, להקל, לסייע או לעודד ביצועו של מעשה כזה;
      3. אם הופרו תנאי תקנון זה;
      4. אם נעשה שימוש באפליקציה במטרה להתחרות באפליקציה;
      5. אם נעשתה על ידי משתמש כל פעולה שתמנע מאחרים להצטרף לאפליקציה או להמשיך ולהשתמש באפליקציה בכל דרך שהיא.
   3. אם יוחלט לסגור או להשהות את חשבונך באפליקציה, אינך רשאי לפתוח חשבון נוסף בשמך, בשם מזויף או מושאל או בשמו של צד שלישי כלשהו. בנוסף לסגירת או השהיית חשבון, האפליקציה שומרת לעצמה את הזכות לנקוט בכל פעולה משפטית. 
10. קניין רוחני:
   1. כל זכויות היוצרים והקניין הרוחני הם בבעלות האפליקציה בלבד, או בבעלות צד שלישי,  שהרשה לאפליקציה לעשות שימוש על פי דין בתכנים אלו ובכלל זה שותפיה העסקיים של האפליקציה.
   2. אין להעתיק, להפיץ, להציג בפומבי, לבצע בפומבי, להעביר לציבור, לשנות, לעבד, ליצור יצירות נגזרות, למכור או להשכיר כל חלק מן הנ"ל, בין ישירות ובין באמצעות או בשיתוף צד שלישי, בכל דרך או אמצעי בין אם אלקטרוניים, מכאניים, אופטיים, אמצעי צילום או הקלטה, או בכל אמצעי ודרך אחרת, בלא קבלת הסכמה בכתב ומראש מהאפליקציה או מבעלי הזכויות האחרים, לפי העניין, ובכפוף לתנאי ההסכמה )ככל שתינתן). הוראה זו תקפה גם ביחס לכל עיבוד, עריכה או תרגום שנעשו על ידי האפליקציה לתכנים שהוזנו או נמסרו על ידי המשתמשים באפליקציה.
   3. אם וככל שניתנה הסכמה כאמור, יש להימנע מלהסיר, למחוק או לשבש כל הודעה או סימן בעניין זכויות קניין רוחני, לדוגמה: סימון זכויות היוצרים ,© או סימן מסחר ®, הנלווים לתכנים שיעשה בהם שימוש.
11. סמכות שיפוט:
   1. על תקנון זה יחולו אך ורק דיני מדינת ישראל, אולם לא תהיה תחולה לכללי ברירת הדין הבינלאומי הקבועים בהם.
   2. לבתי המשפט במחוז חיפה תהיה סמכות שיפוט ייחודית בכל עניין הנובע ו/או הקשור לתקנון זה.
12. מדיניות פרטיות:
   1. כאמור, בעת שימושך באפליקציה ופרסום פרטי ההתקשרות עמך, אתה מאשר ומודע כי ייעשה שימוש במידע שתמסור והוא יגיע ו/או יימכר לצדדים שלישיים, לרבות מתווכים, סוכני מכירות וכד', אשר יפנו אלייך עם הצעות רכישה. 
   2. בנוסף למידע אותו הנך מוסר בעת הרשמתך לאפליקציה, האפליקציה אוספת מידע מסוים אודות המכשיר בו נעשה שימוש באפליקציה, ואנו עשויים להשתמש בנתונים האישיים שלך, ובין היתר, במיקום גיאוגרפי, מידע על השימוש שלך באפליקציה ומידע על המכשיר הנייד שלך  ("המידע הנאסף באפליקציה"). המידע הנאסף באפליקציה עשוי לשמש את האפליקציה לצרכים הבאים:
      1. לספק לך שירותים ולשפר את האפליקציה ו/או את השירותים;
      2. תפעולה התקין של האפליקציה;
      3. לנתח את ולנהל את האפליקציה באופן תקין;
      4. שיפור שירות הלקוחות של האפליקציה;
      5. ליצירת קשר או לספק לך נתונים בקשר לאפליקציה או לשירות.
   3. בעת השימוש באפליקציה, האפליקציה עשויה לאסוף מידע מסוים באופן אוטומטי. לדוגמה:
      1. כתובת ה- IP שלך, פרוטוקול האינטרנט, ספק האינטרנט או הדפדפן וסוג המכשיר בו את משתמש;
      2. הקלטת הפעילות שלך באפליקציה או תרשים העמודים בהם ביקרת;
      3. שימוש בעוגיות על מנת לזהות את המכשיר בו אתה משתמש; 
      4. מידע שתזין, תשתף או שניתן להשיג מהשימוש שלך באפליקציה.
   4. אנו עשויים לשתף את המידע האישי שלך עם צדדים שלישיים (למעט מידע רגיש, כגון פרטי אשראי ותעודות זהות), כולל עם שותפינו העסקיים ונותני שירותים.
   5. דוגמאות לפעולות שנותני שירותים עשויים לבצע הכרוכים במידע שלך:
      1. לפתח ולתחזק את האפליקציה;
      2. לצבור מידע על לקוחות ו/או לשפר את שירות הלקוחות. לאחר מכן, האפליקציה עשויה לשתף מידע כאמור עם שותפי שיווק פוטנציאליים ומפרסמים;
      3. שיתוף רשתות חברתיות כגון פייסבוק, אינסטגרם ואחרות ומפרסמים נוספים ברשת כגון גוגל, טאבולה ואחרים.
   6. לנותני שירותים ושותפים עסקיים כאמור ניתנת גישה לכל או לחלק מהמידע שלך, והם עשויים להשתמש בעוגיות או בטכנולוגיית איסוף אחרות.
13. הרשאה לדיוור, פרסומים ופרסומת:
   1. משתמש באפליקציה מצורף לרשימת הדיוור של האפליקציה, מאשר שימוש בפרטיו לצורך קבלת מידע, עדכונים ודיוור שיתבצעו באמצעות האפליקציה.
   2. על משתמש באפליקציה כאמור תחולנה הוראות הדיוור המפורטות בתקנון להלן. 
   3. בעת השארת פרטים באפליקציה יתבקש המשתמש למסור פרטים אישיים כגון: שם פרטי, שם משפחה, וכן כתובת דואר אלקטרוני פעילה. מסירת פרטים חלקיים או שגויים עלולים למנוע את האפשרות להשתמש בשירות ולסכל יצירת קשר במקרה הצורך. במקרה של שינוי פרטים יש לעדכנם באפליקציה.
   4. מובהר כי אין חובה על-פי חוק למסור פרטים באפליקציה, אולם בלא למוסרם לא ניתן יהיה לקבל דיוור באמצעות האפליקציה. 
   5. האפליקציה לא תעשה בפרטים שנמסרו שימוש, אלא בהתאם למדיניות הפרטיות של האפליקציה המהווה חלק בלתי נפרד מהתקנון.
   6. שימוש באפליקציה ואישור לקבלת דיוור כוללים, בין היתר, קבלת דיוור, תוכן ומידע הנשלחים באמצעות האפליקציה. 
   7. אישור דיוור כאמור, מהווה את הסכמתו של המשתמש למשלוח דברי פרסומת על-פי חוק התקשורת (בזק ושידורים) (תיקון מס' 40) התשס"ח – 2008 ("חוק התקשורת").
   8. מובהר כי באפשרות משתמש להסיר עצמו בכל עת מרשימת הדיוור באמצעות בקשה להסרת החשבון האישי מהאפליקציה. כל עוד לא הסיר עצמו המשתמש כאמור, רשאית האפליקציה, בכפוף לחוק התקשורת, להעביר למשתמש דיוור כאמור.
   9. האפליקציה לא תהיה אחראית לכל נזק (ישיר או עקיף), הפסד, עגמת נפש והוצאות שייגרמו למשתמשים ו/או לצדדים שלישיים כלשהם בעקבות שימוש או הסתמכות על כל תוכן, מידע, נתון, מצג, פרסומת, מוצר, שירות וכד' המופיעים בדיוור. כל הסתמכות כאמור נעשית על-פי שיקול דעתו ואחריותו הבלעדית של המשתמש.
   10. הדיוור בכללותו, לרבות כל המידע המופיע בו, מוצע כמות שהוא, ויהיה מדויק ונכון ככל הניתן, ואולם, יתכן והמידע אינו שלם או לחלופין, יתכן ונפלו טעויות טכניות או אחרות במידע.
   11. המשתמש מאשר כי לא תהיה לו כל טענה בקשר לתוכן, למידע ולדיוור שיישלח אליו. מובהר כי בכל הנוגע לדיוור הנשלח בחסות צד שלישי, לאפליקציה אין כל התערבות בבחירת המידע, אמיתות התוכן וסדר הופעתו.
14. צרו קשר:
   1. האפליקציה מקפידה על קיום הוראות החוק ומכבדת את זכותם של משתמשי האפליקציה ואחרים לפרטיות ולשם טוב. אם אתה סבור כי פורסם באפליקציה תוכן הפוגע בך מטעם כלשהו, נא פנה אלינו לפי הפרטים שלהלן ואנו נשתדל לטפל בפנייתך בכל ההקדם. פניות כאמור ניתן להעביר באמצעים הבאים:
כתובת: שרל לוץ 4א, חיפה;
טלפון: 054-3060964;
או דוא"ל שכתובתו: cookpointapp@gmail.com


כל הזכויות שמורות

עדכון אחרון: אפריל 2021''';
  }
}

class TermsOfServiceMiddleware extends StatelessWidget {
  TermsOfServiceMiddleware({
    Key key,
    this.child,
  }) : super(key: key);

  static const tosVersion = 1;
  static const tosVersionKey = 'tos_version';

  final _stream = StreamController<bool>();

  final Widget child;

  @override
  Widget build(BuildContext context) {
    return FutureBuilder<void>(
      future: _init(),
      builder: (_, __) {
        return StreamBuilder<bool>(
          stream: _stream.stream,
          builder: (_, snapshot) {
            if (snapshot.hasData) {
              return snapshot.data ? child : TermsOfService(onPressed: _accept);
            }

            return const SplashPage();
          },
        );
      },
    );
  }

  Future<void> _init() {
    return SharedPreferences.getInstance()
        .then((prefs) => (prefs.getInt(tosVersionKey) ?? 0) == tosVersion)
        .then(_stream.add);
  }

  Future<void> _accept() {
    return SharedPreferences.getInstance()
        .then((prefs) => (prefs.setInt(tosVersionKey, tosVersion)))
        .then(_stream.add);
  }
}

class CookTermsOfService extends StatelessWidget {
  const CookTermsOfService({
    Key key,
    this.onPressed,
  }) : super(key: key);

  static Route route() {
    return MaterialPageRoute<void>(
      settings: const RouteSettings(name: '/legal/partners/terms-of-service'),
      builder: (_) => const CookTermsOfService(),
    );
  }

  /// @nullable
  final VoidCallback onPressed;

  @override
  Widget build(BuildContext context) {
    return TermsOfService(
      title: const Text('תנאים ומדיניות פרטיות שותפים'),
      onPressed: onPressed,
      body: _getBody(),
    );
  }

  String _getBody() {
    return '''COOKPOINT מברכת את בחירתכם להשתמש באפליקציה בהתאם להוראות השימוש המפורטות בתקנון זה. 
COOKPOINT היא אפליקציה המשמשת כפלטפורמה נוחה לבשלנים לפרסום מזון ביתי ודברי מאכל ("המוצרים") למשתמשי האפליקציה. משתמשי האפליקציה יכולים לערוך חיפוש של בשלנים ומוצרי מזון באפליקציה, ולרכוש מהבשלנים את מוצריהם באמצעות פרטי ההתקשרות המוצגים בפרופיל הבשלן.  
תקנון ותנאי שימוש אלה מהווים הסכם מחייב בינך (״אתה״) לבין האפליקציה בנוגע לשימוש באפליקציה בכל טלפון סלולרי, טאבלט או מכשיר תקשורת אחר כדוגמת מחשב. כמו כן הם חלים על השימוש באפליקציה, בין באמצעות רשת האינטרנט ובין באמצעות כל רשת או אמצעי תקשורת אחר (״האפליקציה״). קרא את תנאי השימוש בקפידה, שכן השימוש באפליקציה וביצוע פעולות בה מעידים על הסכמתך לתנאים הכלולים בתקנון ותנאי שימוש אלו (״התקנון״). 
1. כללי:
 1. האמור בתקנון זה מתייחס באופן שווה לבני שני המינים והשימוש בלשון זכר או נקבה הוא מטעמי נוחות בלבד. 
 2. השימוש באפליקציה מותר בכל גיל. 
 3. תנאי תקנון זה מהווים את כל ההסכמות וההבנות בנוגע לשימוש באפליקציה. אי מימוש או אכיפה של זכות או הוראה בתקנון זה, לא תחשב כוויתור מצד האפליקציה על מימוש הזכות או אכיפת ההוראה. האפליקציה תהיה רשאי להמחות לאחרים את כל או חלק מזכויותיה ו/או חובותיה בתקנון זה.
 4. במקרה שייקבע כי הוראה בתקנון זה אינה ניתנת לאכיפה או שהינה חסרת תוקף מטעם כלשהו, לא יהא בכך כדי להשפיע או לפגוע בחוקיותן, תקפותן ואכיפתן של שאר הוראות התקנון.
 5. תנאי תקנון זה הינם בנוסף לתנאי השימוש בתקנון האפליקציה למשתמשים ומהווה חלק בלתי נפרד ממנו. 
2. רכישת מנוי באפליקציה:
 1. על מנת לפרסם באפליקציה יש להירשם ולרכוש מנוי פרסום. ההרשמה תתבצע באמצעות הזנת מספר הטלפון של הרוכש. לאחר הזנת מספר הטלפון, הרוכש יקבל הודעה עם סיסמה לאפליקציה שתאפשר המשך רכישה ופתיחת פרופיל באפליקציה. 
 2. האפליקציה לא תעשה בפרטים שנמסרו שימוש, אלא בהתאם להוראות התקנון ובהתאם למדיניות הפרטיות להלן המהווה חלק בלתי נפרד מתקנון זה.
 3. האפליקציה רשאית לקבוע, מעת לעת, דרכי זיהוי לכניסה לאפליקציה ובכלל זה התחברות לאפליקציה דרך הפייסבוק ו/או רשת חברתית אחרת ו/או פלטפורמה אחרת.
 4. בעת ההרשמה, הבשלן מצהיר כי הוא בעל אישור ממשרד הבריאות למכירת המוצרים, וכן כי יש בבעלותו אישור עוסק (חברה בע"מ או סוגי העוסק למיניהם).
 5.  בשימוש באפליקציה המשתמש מאשר כי: (1) לא יירשם לאפליקציה עם פרטים חלקיים או שגויים ולא יתחזה למשתמש אחר; (2) לא יעביר לאחר את שם המשתמש והסיסמה לחשבונו האישי ו/או יאפשר לאחר גישה לחשבונו האישי.
 6. המחיר המופיע באפליקציה עבור ההרשמה הינו המחיר העדכני. האפליקציה רשאית לעדכן מעת לעת את המחירים, ללא קשר למועד ביצוע רכישה באפליקציה, וללא צורך בהודעה על כך.
 7. התשלום בגין הרשמה לאפליקציה יתבצע באמצעי התשלום המופיע בעמוד התשלום. בנוסף להוראות התקנון יחולו גם הוראות תקנון חברת הסליקה או אמצעי התשלום האחר. 
 8. ההרשמה לאפליקציה תבוצע בכפוף לאישור העסקה על ידי האפליקציה. במקרה בו לא אושרה העסקה על ידי האפליקציה, יקבל הנרשם הודעה וחשבונו לא יחויב בגין העסקה.
 9. מתן השירות יתאפשר בכפוף לשיקול דעתה הבלעדי של האפליקציה והאפליקציה לא תהא אחראית לכל איחור ו/או עיכוב במתן השירות ו/או אי-מתן השירות, כתוצאה מכוח עליון ו/או תקלות טכניות ו/או מאירועים שאינם בשליטתה.
 10. לאחר ההרשמה והתשלום, יוקם פרופיל עבור הבשלן בו עליו לעדכן את שם הבשלן או שם העסק, תמונת פרופיל, כתובת, פרטי התקשרות, תמונות של המוצרים המוצעים לרכישה, תיאור המוצרים ועלויות המוצרים. 
3. מדיניות ביטול:
 1. בקשה להחזר, שינוי או ביטול עסקה תועבר לאפליקציה באחד מאמצעי ההתקשרות המופיעים בתחתית התקנון. 
 2. ניתן לבטל הרשמה למנוי בכל עת, ולקבל החזר כספי בגין התקופה שנותרה עד לסיום תקופת המנוי. 
 3. החזר או ביטול יאושרו לאחר שהלקוח יקבל הודעה בכתב מהאפליקציה המאשרת זאת.
 4. החזר כספי יעשה באמצעי התשלום שבו ביצע הלקוח את ההזמנה בלבד.
 5. האמור לעיל כפוף להוראות ביטול עסקה בהתאם לחוק הגנת הצרכן, התשמ"א-1981.
4. פרסום תכנים באפליקציה:
 1. בעת שיגור או מסירת תכנים לפרסום באפליקציה, חלה על המפרסם האחריות המלאה והבלעדית לכל תוצאה שתנבע מהפרסום ועליו להקפיד שתכנים כאלה יהיו חוקיים. בין השאר ולמען הדוגמה בלבד, אין לפרסם באפליקציה את התכנים הבאים:
    1. כל תוכן הידוע כשקרי, מטעה או מסולף;
    2. כל תוכן הפוגע בזכויות קנייניות של אחרים או מפר אותן לרבות זכויות יוצרים וסימני מסחר;
    3. כל תוכן העלול להטעות צרכן ו/או משתמש;
    4. כל תוכן בעל אופי פרסומי או מסחרי;
    5. כל תוכן פורנוגראפי או בעל אופי מיני בוטה;
    6. כל תוכן הנוגע לקטינים ומזהה אותם, את פרטיהם האישיים או את מענם ודרכי ההתקשרות עימם;
    7. כל תוכן המזהה אישית אנשים אחרים, מבלי שנתנו את הסכמתם לפרסום זהותם;
    8. כל תוכנת מחשב, קוד מחשב או יישום הכוללים נגיף מחשב ("וירוס") לרבות תוכנות עוינות ויישומים מזיקים למיניהם;
    9. כל תוכן המהווה לשון הרע על אדם, או הפוגע בפרטיותו או בשמו הטוב;
    10. כל תוכן בעל אופי או תוכן טורדני, מעליב, עוין, מאיים או גס רוח;
    11. כל תוכן שיש בו, או הוא מעודד לגזענות או אפליה פסולה על בסיס כלשהו;
    12. כל תוכן המעודד ביצוע עבירה פלילית או עלול להוות בסיס לתביעה אזרחית;
    13. כל תוכן המנוגד לכללי השימוש המקובלים באינטרנט או העלול לגרום נזק או לפגוע במשתמשי אינטרנט בכלל ובמשתמשי האפליקציה בפרט;
    14. במידה והנך משאיר ביקורת שלילית, אינך קשור למתחרי האפליקציה.
 2. האפליקציה רשאית לסרב לפרסם או למחוק לאלתר כל תוכן שנמסר לפרסום בכל עת שימצא כי הופרו תנאי התקנון או שתכנים שפורסמו פוגעים או עלולים לפגוע בשירותים הניתנים באפליקציה, במשתמשיה או במי מטעמה. בנוסף, האפליקציה תהיה רשאית במקרה זה למנוע ממשתמש מלפרסם תכנים נוספים באפליקציה ו/או לחסום את גישתו לאפליקציה. הוראות סעיף זה מוסיפות על זכויות האפליקציה על פי כל דין.
 3.  האפליקציה רשאית לערוך כל תוכן שנשלח לפרסום, לפי שיקול דעתה המוחלט ובכלל זה לקצרו.
 4. מסירת תכנים לפרסום באפליקציה מהווה אישור כי המפרסם הוא בעל כל הזכויות בהם וכי הוא רשאי למוסרם לפרסום ו/או הוא בעל הרשאה כדין מבעל הזכויות, המתירה לו למסור את התכנים לפרסום באפליקציה. מובהר כי המפרסם מוחזק כאחראי לשאת בכל נזק ו/או הפסד ו/או תביעה ו/או דרישה שיוגשו נגד האפליקציה בגין שימוש ללא היתר בתכנים כאמור.
 5. במסירת התכנים לפרסום מוקנה לאפליקציה רישיון חינם, כלל עולמי ובלתי מוגבל בזמן, להעתיק, לשכפל, להפיץ, לשווק, למסור לציבור, לעבד, לערוך, לתרגם ולהשתמש בתכנים כאמור בכל דרך נוספת, לפי שיקול דעתה, באתר, בדברי דפוס, לרבות בעיתונים, מגזינים, כתבי עת, ספרים וכיו"ב, במדיות דיגיטליות, לרבות באתרי אינטרנט נוספים, בארכיבים דיגיטאליים ובשירותים הניתנים ברשתות תקשורת, לרבות תקשורת חוטית, אל חוטית, סלולארית, כבלים ולוויין.
5. אחריות האפליקציה:
 1. אין לראות במידע המופיע באפליקציה משום הבטחה לתוצאה כלשהי ו/או אחריות לאופן מתן השירות. האפליקציה לא תהיה אחראית לשום נזק, ישיר או עקיף, אשר ייגרם למשתמש כתוצאה מהסתמכות על מידע המופיע באפליקציה ו/או בקישורים אחרים ו/או כל מקור מידע פנימי ו/או חיצוני אחר ו/או שימוש בשירותים אשר מוצגים על ידה.
 2. התכנים באפליקציה ניתנים לשימוש כמות שהם (AS-IS). לא ניתן להתאימם לצרכיו של כל אדם ואדם. לא תהיה למשתמש כל טענה, תביעה או דרישה כלפי האפליקציה בגין תכונות של התכנים, יכולותיהם, מגבלותיהם ו/או התאמתם לצרכיו והשימוש באפליקציה יהיה על אחריותו הבלעדית של המשתמש באפליקציה.
 3. האפליקציה אינה צד להתקשרות בין הלקוח לבשלן והוא פועל אך ורק בכדי לקשר בין המשתמשים לבשלנים. רכישה מהבשלנים באפליקציה תתבצע באופן ישיר מול הבשלן באמצעות פרטי ההתקשרות המופיעים בפרופיל הבשלן.
 4. מידע ומצגים המוצגים באפליקציה, שמקורם בבשלנים שמוצריהם מופיעים באפליקציה וכל תוכן ביחס למוצרים נמצאים באחריותם הבלעדית של הבשלנים כאמור, ועל כן מובן שלאפליקציה אין כל אחריות בגין מידע מעין זה, ואין האפליקציה ערבה למידת הדיוק של מידע זה. לפיכך, האפליקציה לא תהווה תחליף או תישא באחריות של הבשלנים על אופן אספקת המוצרים, מועד האספקה, טיב המוצרים, תשלום וכיו״ב. במקרה זה, הבשלנים יישאו באחריות על כל פניה ו/או תביעה ו/או דרישה של משתמשי האפליקציה אשר רכשו דרכם בגין פיצוי בגין כל נזק, ישיר או עקיף, אשר ייגרם להם.
 5. האפליקציה לא תהיה אחראית לכל נזק (ישיר או עקיף), הפסד, עגמת נפש והוצאות שייגרמו למשתמשים ו/או לצדדים שלישיים כלשהם בעקבות שימוש או הסתמכות על כל תוכן, מידע, נתון, מצג, תמונה, וידאו, אודיו, פרסומת, מוצר, שירות וכו' המופעים באפליקציה. כל הסתמכות כאמור נעשית על-פי שיקול דעתו ואחריותו הבלעדית של המשתמש באפליקציה.
 6. האפליקציה ממליצה למשתמשים לנהוג בתבונה ובזהירות, ולקרוא בעיון את המידע המוצג באפליקציה ובכלל זה את המידע ביחס לשירות עצמו, תיאורו והתאמתו, כמתואר להלן.
 7. האפליקציה אינה אחראית על מספר הלקוחות שיפנו לבשלן ו/או ירכשו מוצרים מהבשלן, ולבלשנים המשתמשים בשירותי האפליקציה לא תהיה כל טענה ו/או דרישה ו/או תביעה כלפי האפליקציה בגין מספר הלקוחות שיפנו אליהם ו/או ירכשו מהם מוצרים ו/או יצפו בפרופיל שלהם.
 8. השימוש באפליקציה ייעשה על אחריותו הבלעדית והמלאה של כל משתמש. כל החלטה שתתקבל ביחס לתכנים שיתפרסמו באפליקציה הינה באחריותו המלאה. 
6. סיום:
 1. תנאי תקנון זה יישארו בתוקפם בעת השימוש באפליקציה. מבלי לגרוע מכל הוראה אחרת בתקנון זה, האפליקציה שומרת על זכותה למנוע מכל משתמש את השימוש באפליקציה (לרבות חסימת כתובות IP מסוימות), מכל סיבה או נימוק שהוא (מבלי שתצטרך לספק סיבה או נימוק), לשיקול דעתה הבלעדי, ללא צורך בהודעה מוקדמת או התראה ומבלי שתהיה אחראית לנזק כלשהו עקב החלטתה. כמו כן, האפליקציה רשאית להפסיק את השימוש שלך בה ו/או למחוק את חשבונך וכל תוכן או מידע שפרסמת בכל עת, ללא אזהרה מראש.
 2. מבלי לגרוע מהאמור לעיל, האפליקציה רשאית למנוע שימוש ממשתמש, או לחסום גישתם אליה בכל אחד מהמקרים הבאים:
    1. אם בעת ההרשמה לאפליקציה נמסרו במתכוון פרטים שגויים;
    2. במקרה שנעשה שימוש באפליקציה לביצוע או כדי לנסות לבצע מעשה בלתי חוקי על-פי דיני מדינת ישראל, או מעשה הנחזה על פניו כבלתי חוקי כאמור, או כדי לאפשר, להקל, לסייע או לעודד ביצועו של מעשה כזה;
    3. אם הופרו תנאי תקנון זה;
    4. אם נעשה שימוש באפליקציה במטרה להתחרות באפליקציה;
    5. אם נעשתה על ידי משתמש כל פעולה שתמנע מאחרים להצטרף לאפליקציה או להמשיך ולהשתמש באפליקציה בכל דרך שהיא.
 3. אם יוחלט לסגור או להשהות את חשבונך באפליקציה, אינך רשאי לפתוח חשבון נוסף בשמך, בשם מזויף או מושאל או בשמו של צד שלישי כלשהו. בנוסף לסגירת או השהיית חשבון, האפליקציה שומרת לעצמה את הזכות לנקוט בכל פעולה משפטית. 
7. סמכות שיפוט:
 1. על תקנון זה יחולו אך ורק דיני מדינת ישראל, אולם לא תהיה תחולה לכללי ברירת הדין הבינלאומי הקבועים בהם.
 2. לבתי המשפט במחוז חיפה תהיה סמכות שיפוט ייחודית בכל עניין הנובע ו/או הקשור לתקנון זה.
8. הרשאה לדיוור, פרסומים ופרסומת:
 1. משתמש באפליקציה הנרשם לאפליקציה מצורף לרשימת הדיוור של האפליקציה, מאשר שימוש בפרטיו לצורך קבלת מידע, עדכונים ודיוור שיתבצעו באמצעות האפליקציה.
 2. על משתמש באפליקציה כאמור תחולנה הוראות הדיוור המפורטות בתקנון להלן. 
 3. בעת השארת פרטים באפליקציה יתבקש המשתמש למסור פרטים אישיים כגון: שם פרטי, שם משפחה, וכן כתובת דואר אלקטרוני פעילה. מסירת פרטים חלקיים או שגויים עלולים למנוע את האפשרות להשתמש בשירות ולסכל יצירת קשר במקרה הצורך. במקרה של שינוי פרטים יש לעדכנם באפליקציה.
 4. מובהר כי אין חובה על-פי חוק למסור פרטים באפליקציה, אולם בלא למוסרם לא ניתן יהיה לקבל דיוור באמצעות האפליקציה. 
 5. האפליקציה לא תעשה בפרטים שנמסרו שימוש, אלא בהתאם למדיניות הפרטיות של האפליקציה המהווה חלק בלתי נפרד מהתקנון.
 6. שימוש באפליקציה ואישור לקבלת דיוור כוללים, בין היתר, קבלת דיוור, תוכן ומידע הנשלחים באמצעות האפליקציה. 
 7. אישור דיוור כאמור, מהווה את הסכמתו של המשתמש למשלוח דברי פרסומת על-פי חוק התקשורת (בזק ושידורים) (תיקון מס' 40) התשס"ח – 2008 ("חוק התקשורת").
 8. מובהר כי באפשרות משתמש להסיר עצמו בכל עת מרשימת הדיוור באמצעות בקשה להסרת החשבון האישי מהאפליקציה. כל עוד לא הסיר עצמו המשתמש כאמור, רשאית האפליקציה, בכפוף לחוק התקשורת, להעביר למשתמש דיוור כאמור.
 9. האפליקציה לא תהיה אחראית לכל נזק (ישיר או עקיף), הפסד, עגמת נפש והוצאות שייגרמו למשתמשים ו/או לצדדים שלישיים כלשהם בעקבות שימוש או הסתמכות על כל תוכן, מידע, נתון, מצג, פרסומת, מוצר, שירות וכד' המופיעים בדיוור. כל הסתמכות כאמור נעשית על-פי שיקול דעתו ואחריותו הבלעדית של המשתמש.
 10. הדיוור בכללותו, לרבות כל המידע המופיע בו, מוצע כמות שהוא, ויהיה מדויק ונכון ככל הניתן, ואולם, יתכן והמידע אינו שלם או לחלופין, יתכן ונפלו טעויות טכניות או אחרות במידע.
 11. המשתמש מאשר כי לא תהיה לו כל טענה בקשר לתוכן, למידע ולדיוור שיישלח אליו. מובהר כי בכל הנוגע לדיוור הנשלח בחסות צד שלישי, לאפליקציה אין כל התערבות בבחירת המידע, אמיתות התוכן וסדר הופעתו.
9. צרו קשר:
 1. האפליקציה מקפידה על קיום הוראות החוק ומכבדת את זכותם של משתמשי האפליקציה ואחרים לפרטיות ולשם טוב. אם אתה סבור כי פורסם באפליקציה תוכן הפוגע בך מטעם כלשהו, נא פנה אלינו לפי הפרטים שלהלן ואנו נשתדל לטפל בפנייתך בכל ההקדם. פניות כאמור ניתן להעביר באמצעים הבאים:
כתובת: שרל לוץ 4א, חיפה;
טלפון: 054-3060964;
או דוא"ל שכתובתו: cookpointapp@gmail.com


כל הזכויות שמורות

עדכון אחרון: אפריל 2021''';
  }
}

class CookTermsOfServiceMiddleware extends StatelessWidget {
  CookTermsOfServiceMiddleware({
    Key key,
    this.child,
  }) : super(key: key);

  static const tosVersion = 1;
  static const tosVersionKey = 'cook_tos_version';

  final _stream = StreamController<bool>();

  final Widget child;

  @override
  Widget build(BuildContext context) {
    return FutureBuilder<void>(
      future: _init(),
      builder: (_, __) {
        return StreamBuilder<bool>(
          stream: _stream.stream,
          builder: (_, snapshot) {
            if (snapshot.hasData) {
              return snapshot.data
                  ? child
                  : CookTermsOfService(onPressed: _accept);
            }

            return const SplashPage();
          },
        );
      },
    );
  }

  Future<void> _init() {
    return SharedPreferences.getInstance()
        .then((prefs) => (prefs.getInt(tosVersionKey) ?? 0) == tosVersion)
        .then(_stream.add);
  }

  Future<void> _accept() {
    return SharedPreferences.getInstance()
        .then((prefs) => (prefs.setInt(tosVersionKey, tosVersion)))
        .then(_stream.add);
  }
}
